witalis3/UA3REO-DDC-Transceiver/STM32/Src/wifi.c
	case WIFI_UNDEFINED:
	case WIFI_NOTFOUND:
	case WIFI_FAIL:
	case WIFI_SLEEP:
		break;
	}
}

bool WIFI_GetSNTPTime(void *callback)
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_GETSNTP;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_SendCommand("AT+CIPSNTPTIME?\r\n"); //get SNMP time
	return true;
}

bool WIFI_GetIP(void *callback)
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_GETIP;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_SendCommand("AT+CIPSTA_CUR?\r\n"); //get ip
	return true;
}

void WIFI_ListAP(void *callback)
{
	if (WIFI_State != WIFI_READY && WIFI_State != WIFI_CONFIGURED)
		return;
	if (WIFI_State == WIFI_CONFIGURED && !WIFI_stop_auto_ap_list) // stop auto-connection when searching for networks
	{
		WIFI_stop_auto_ap_list = true;
		WIFI_WaitForOk();
	}
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_LISTAP;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_FoundedAP_Index = 0;

	for (uint8_t i = 0; i < WIFI_FOUNDED_AP_MAXCOUNT; i++)
		memset((char *)&WIFI_FoundedAP_InWork[i], 0x00, sizeof WIFI_FoundedAP_InWork[i]);
	WIFI_SendCommand("AT+CWLAP\r\n"); //List AP
}

static bool WIFI_ListAP_Sync(void)
{
	WIFI_SendCommand("AT+CWLAP\r\n"); //List AP
	WIFI_FoundedAP_Index = 0;
	for (uint8_t i = 0; i < WIFI_FOUNDED_AP_MAXCOUNT; i++)
		memset((char *)&WIFI_FoundedAP[i], 0x00, sizeof WIFI_FoundedAP[i]);
	uint32_t startTime = HAL_GetTick();
	char *sep = "OK";
	char *istr;

	while ((HAL_GetTick() - startTime) < WIFI_COMMAND_TIMEOUT)
	{
		if (!WIFI_TryGetLine())
		{
			CPULOAD_GoToSleepMode();
			CPULOAD_WakeUp();
			continue;
		}

		istr = strstr(WIFI_readedLine, sep);
		if (istr != NULL)
			return true;

		if (strlen(WIFI_readedLine) > 5) //-V814
		{
			char *start = strchr(WIFI_readedLine, '"');
			if (start != NULL)
			{
				start = start + 1;
				char *end = strchr(start, '"');
				if (end != NULL)
				{
					*end = 0x00;
					strcat((char *)&WIFI_FoundedAP[WIFI_FoundedAP_Index], start);
					if (WIFI_FoundedAP_Index < WIFI_FOUNDED_AP_MAXCOUNT)
						WIFI_FoundedAP_Index++;
				}
			}
		}
	}
	return false;
}

void WIFI_GoSleep(void)
{
	if (WIFI_State == WIFI_SLEEP)
		return;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_DEEPSLEEP;
	WIFI_SendCommand("AT+GSLP=1000\r\n"); //go sleep
	WIFI_State = WIFI_SLEEP;
}

static void WIFI_SendCommand(char *command)
{
	HAL_UART_AbortReceive(&huart6);
	HAL_UART_AbortReceive_IT(&huart6);
	memset(WIFI_AnswerBuffer, 0x00, sizeof(WIFI_AnswerBuffer));
	WIFI_Answer_ReadIndex = 0;
	HAL_UART_Receive_DMA(&huart6, (uint8_t *)WIFI_AnswerBuffer, WIFI_ANSWER_BUFFER_SIZE);
	HAL_Delay(100);
	HAL_UART_Transmit_IT(&huart6, (uint8_t *)command, (uint16_t)strlen(command));
	commandStartTime = HAL_GetTick();
	HAL_Delay(WIFI_COMMAND_DELAY);
	if (WIFI_DEBUG) //DEBUG
		sendToDebug_str2("WIFI_S: ", command);
}

static bool WIFI_WaitForOk(void)
{
	char *sep = "OK";
	char *sep2 = "ERROR";
	char *istr;
	uint32_t startTime = HAL_GetTick();
	while ((HAL_GetTick() - startTime) < WIFI_COMMAND_TIMEOUT)
	{
		if (WIFI_TryGetLine())
		{
			//OK
			istr = strstr(WIFI_readedLine, sep);
			if (istr != NULL)
				return true;
			//ERROR
			istr = strstr(WIFI_readedLine, sep2);
			if (istr != NULL)
				return false;
		}
		CPULOAD_GoToSleepMode();
		CPULOAD_WakeUp();
	}
	return false;
}

static bool WIFI_TryGetLine(void)
{
	memset(WIFI_readedLine, 0x00, sizeof(WIFI_readedLine));
	memset(tmp, 0x00, sizeof(tmp));

	uint16_t dma_index = WIFI_ANSWER_BUFFER_SIZE - (uint16_t)__HAL_DMA_GET_COUNTER(huart6.hdmarx);
	if (WIFI_Answer_ReadIndex == dma_index)
		return false;

	strncpy(tmp, &WIFI_AnswerBuffer[WIFI_Answer_ReadIndex], dma_index - WIFI_Answer_ReadIndex);
	if (tmp[0] == '\0')
		return false;

	char *istr = strchr(tmp, '\n'); // look for the end of the line
	if (istr == NULL)
		return false;
	uint16_t len = (uint16_t)((uint32_t)istr - (uint32_t)tmp + 1);
	strncpy(WIFI_readedLine, tmp, len);

	WIFI_Answer_ReadIndex += len;
	if (WIFI_Answer_ReadIndex > dma_index)
		WIFI_Answer_ReadIndex = dma_index;

	if (WIFI_DEBUG) //DEBUG
		sendToDebug_str2("WIFI_R: ", WIFI_readedLine);

	return true;
}

bool WIFI_StartCATServer(void *callback)
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_CREATESERVER;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_SendCommand("AT+CIPSERVER=1,6784\r\n"); //Start CAT Server
	return true;
}

bool WIFI_SendCatAnswer(char *data, uint32_t link_id, void *callback)
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_SENDTCPDATA;
	WIFI_ProcessingCommandCallback = callback;
	char answer[64] = {0};
	sprintf(answer, "AT+CIPSEND=%u,%u\r\n", link_id, strlen(data));
	WIFI_SendCommand(answer); //Send CAT answer
	char answer_data[64] = {0};
	strcat(answer_data, data);
	strcat(answer_data, "\r");
	WIFI_SendCommand(answer_data); //Send CAT answer data
	WIFI_ProcessingCommand = WIFI_COMM_NONE;
	WIFI_State = WIFI_READY;
	return true;
}

bool WIFI_UpdateFW(void *callback)
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_UPDATEFW;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_SendCommand("AT+CIUPDATE\r\n"); //Start Update Firmware
	WIFI_WaitForOk();
	return true;
}

static void WIFI_getHTTPResponse(void)
{
	char *istr;
	istr = strstr(WIFI_readedLine, "+IPD");
	if (istr != NULL)
	{
		istr += 7;
		char *istr2 = strstr(WIFI_readedLine, ":");
		if (istr2 != NULL)
		{
			*istr2 = 0;
			uint32_t response_length = atoi(istr);
			istr2++;
			strcpy(WIFI_HTTResponseHTML, istr2);
			commandStartTime = HAL_GetTick();
			
			uint32_t start_time = HAL_GetTick();
			while(strlen(WIFI_HTTResponseHTML) < response_length && strlen(WIFI_HTTResponseHTML) < sizeof(WIFI_HTTResponseHTML) && (HAL_GetTick() - start_time) < 5000)
			{
				if(WIFI_TryGetLine())
					strcat(WIFI_HTTResponseHTML, WIFI_readedLine);
			}
			char *istr3 = WIFI_HTTResponseHTML;
			istr3 += response_length;
			*istr3 = 0;
			
