witalis3/UA3REO-DDC-Transceiver/STM32/Src/wifi.c
			//get status
			char *istr4 = strstr(WIFI_HTTResponseHTML, " ");
			if (istr4 != NULL)
			{
				char *istr5 = istr4 + 4;
				*istr5 = 0;
				WIFI_HTTP_Response_Status = (uint16_t)(atoi(istr4));
				*istr5 = ' ';
			}
			
			//get content length
			istr4 = strstr(WIFI_HTTResponseHTML, "Content-Length: ");
			if (istr4 != NULL)
			{
				istr4 += 16;
				char *istr5 = strstr(istr4, "\r");
				*istr5 = 0;
				WIFI_HTTP_Response_ContentLength = (uint32_t)(atoi(istr4));
				*istr5 = ' ';
			}
			
			//get response body
			char *istr6 = strstr(WIFI_HTTResponseHTML, "\r\n\r\n");
			if (istr6 != NULL)
			{
				istr6 += 4;
				strcpy(WIFI_HTTResponseHTML , istr6);
			}
			
			//may be partial content? continue downloading
			start_time = HAL_GetTick();
			if(strlen(WIFI_HTTResponseHTML) < WIFI_HTTP_Response_ContentLength && (HAL_GetTick() - start_time) < 2000)
			{
				//sendToDebug_strln("PARTIAL CONTENT");
				//sendToDebug_uint32(strlen(WIFI_HTTResponseHTML),false);
				while(strlen(WIFI_HTTResponseHTML) < WIFI_HTTP_Response_ContentLength && strlen(WIFI_HTTResponseHTML) < sizeof(WIFI_HTTResponseHTML) && (HAL_GetTick() - start_time) < 2000)
				{
					if(WIFI_TryGetLine())
					{
						istr = strstr(WIFI_readedLine, "+IPD");
						//sendToDebug_strln("\r\nIPD");
						if (istr != NULL)
						{
							istr += 7;
							istr2 = strstr(WIFI_readedLine, ":");
							if (istr2 != NULL)
							{
								*istr2 = 0;
								response_length = atoi(istr);
								istr2++;
								strncat(WIFI_HTTResponseHTML, istr2, response_length);
								
								//sendToDebug_str("\r\nadd");
								//sendToDebug_uint32(response_length,false);
							}
						}
					}
				}
				//sendToDebug_strln("end");
				//sendToDebug_uint32(strlen(WIFI_HTTResponseHTML),false);
			}
			
			//cut body on content-length
			if(strlen(WIFI_HTTResponseHTML) > WIFI_HTTP_Response_ContentLength)
				WIFI_HTTResponseHTML[WIFI_HTTP_Response_ContentLength] = 0;
			sendToDebug_uint32(strlen(WIFI_HTTResponseHTML),false);
			
			WIFI_ProcessingCommand = WIFI_COMM_NONE;
			WIFI_State = WIFI_READY;
			if (WIFI_ProcessingCommandCallback != NULL)
				WIFI_ProcessingCommandCallback();
		}
	}
}

static void WIFI_sendHTTPRequest(void)
{
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_TCP_GET_RESPONSE;
	memset(WIFI_HTTRequest, 0x00, sizeof(WIFI_HTTRequest));
	strcat(WIFI_HTTRequest, "GET ");
	strcat(WIFI_HTTRequest, WIFI_GETuri);
	strcat(WIFI_HTTRequest, " HTTP/1.1\r\n");
	strcat(WIFI_HTTRequest, "Host: ");
	strcat(WIFI_HTTRequest, WIFI_HOSTuri);
	strcat(WIFI_HTTRequest, "\r\nConnection: close\r\n\r\n");
	char comm_line[64] = {0};
	sprintf(comm_line, "AT+CIPSEND=0,%d\r\n", strlen(WIFI_HTTRequest));
	WIFI_SendCommand(comm_line);
	WIFI_SendCommand(WIFI_HTTRequest);
}

bool WIFI_getHTTPpage(char* host, char* url, void *callback, bool https)
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_TCP_CONNECT;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_HTTP_Response_Status = 0;
	
	memset(WIFI_HOSTuri, 0x00, sizeof(WIFI_HOSTuri));
	strcat(WIFI_HOSTuri, "AT+CIPSTART=0,");
	if(!https)
		strcat(WIFI_HOSTuri, "\"TCP\"");
	else
		strcat(WIFI_HOSTuri, "\"SSL\"");
	strcat(WIFI_HOSTuri, ",\"");
	strcat(WIFI_HOSTuri, host);
	
	if(!https)
		strcat(WIFI_HOSTuri, "\",80,10\r\n");
	else
		strcat(WIFI_HOSTuri, "\",443,10\r\n");
	
	memset(WIFI_GETuri, 0x00, sizeof(WIFI_GETuri));
	strcat(WIFI_GETuri, url);
	
	WIFI_SendCommand(WIFI_HOSTuri);
	
	memset(WIFI_HOSTuri, 0x00, sizeof(WIFI_HOSTuri));
	strcat(WIFI_HOSTuri, host);
	return true;
}

static void WIFI_printText_callback(void)
{
	LCDDriver_Fill(BG_COLOR);
	if(WIFI_HTTP_Response_Status == 200)
	{
		LCDDriver_printTextFont(WIFI_HTTResponseHTML, 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
		//sendToDebug_uint32(strlen(WIFI_HTTResponseHTML),false);
		//sendToDebug_strln(WIFI_HTTResponseHTML);
	}
	else
		LCDDriver_printTextFont("Network error", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
}

IRAM2 static int16_t WIFI_RLEStreamBuffer[1024] = {0};
static uint16_t WIFI_RLEStreamBuffer_part = 0;
static void WIFI_printImage_stream_callback(void)
{
	memset(WIFI_RLEStreamBuffer, 0x00, sizeof(WIFI_RLEStreamBuffer));
	//parse hex output from server (convert to bin)
	char *istr = WIFI_HTTResponseHTML;
	char hex[5] = {0};
	uint16_t index = 0;
	int16_t val =0;
	while(*istr != 0 && (strlen(WIFI_HTTResponseHTML) > (index * 4)))
	{
		//Get hex
		strncpy(hex, istr , 4);
		val = (int16_t)(strtol(hex, NULL, 16));
		istr += 4;
		//Save
		WIFI_RLEStreamBuffer[index] = val;
		index++;
	}
	WIFI_HTTResponseHTML[index] = 0;
	sendToDebug_uint32(index,false);
	//send to LCD RLE stream decoder
	LCDDriver_printImage_RLECompressed_ContinueStream(WIFI_RLEStreamBuffer, index);
	WIFI_RLEStreamBuffer_part++;
	if(index >= 128 && LCD_systemMenuOpened)
	{
		char url[64] = {0};
		sprintf(url, "/trx_services/propagination.php?part=%d", WIFI_RLEStreamBuffer_part);
		WIFI_getHTTPpage("ua3reo.ru", url, WIFI_printImage_stream_callback, false);
	}
}

static void WIFI_printImage_callback(void)
{
	LCDDriver_Fill(BG_COLOR);
	if(WIFI_HTTP_Response_Status == 200)
	{
		char *istr1 = strstr(WIFI_HTTResponseHTML, ",");
		if (istr1 != NULL)
		{
			*istr1 = 0;
			uint32_t filesize = atoi(WIFI_HTTResponseHTML);
			istr1++;
			char *istr2 = strstr(istr1, ",");
			if (istr2 != NULL)
			{
				*istr2 = 0;
				uint16_t width = (uint16_t)(atoi(istr1));
				istr2++;
				
				uint16_t height = (uint16_t)(atoi(istr2));
				
				//sendToDebug_uint32(filesize, false);
				//sendToDebug_uint32(width, false);
				//sendToDebug_uint32(height, false);
				if(filesize > 0 && width > 0  && height > 0)
				{
					LCDDriver_printImage_RLECompressed_StartStream(LCD_WIDTH / 2 - width / 2, LCD_HEIGHT / 2 - height / 2, width, height);
					WIFI_RLEStreamBuffer_part = 0;
					WIFI_getHTTPpage("ua3reo.ru", "/trx_services/propagination.php?part=0", WIFI_printImage_stream_callback, false);
				}
			}
		}
	}
	else
		LCDDriver_printTextFont("Network error", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
}

void WIFI_getRDA(void)
{
	LCDDriver_Fill(BG_COLOR);
	if(WIFI_connected && WIFI_State == WIFI_READY)
		LCDDriver_printTextFont("Loading...", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
	else
	{
		LCDDriver_printTextFont("No connection", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
		return;
	}
	char url[64] = "/trx_services/rda.php?callsign=";
	strcat(url, TRX.CALLSIGN);
	WIFI_getHTTPpage("ua3reo.ru", url, WIFI_printText_callback, false);
}

void WIFI_getPropagination(void)
{
	LCDDriver_Fill(BG_COLOR);
	if(WIFI_connected && WIFI_State == WIFI_READY)
		LCDDriver_printTextFont("Loading...", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
	else
	{
		LCDDriver_printTextFont("No connection", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
		return;
	}
	WIFI_getHTTPpage("ua3reo.ru", "/trx_services/propagination.php", WIFI_printImage_callback, false);
}
